app/controllers/tweets_controller.rb

    def index
      @tweets = Tweet.all
---
SELECT `tweets`.* FROM `tweets`

      def create
        tweet = Tweet.new(tweet_params)

        tweet.user_id = current_user.id

        if tweet.save
---
INSERT INTO `tweets` (`body`, `created_at`, `updated_at`) VALUES ('huij', '2020-11-03 02:37:35.420099', '2020-11-03 02:37:35.420099')

      def show
        @tweet = Tweet.find(params[:id])
---
SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 1 LIMIT 1

      def edit
        @tweet = Tweet.find(params[:id])
---
SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 1 LIMIT 1

      def update
        tweet = Tweet.find(params[:id])
        if tweet.update(tweet_params)
---
SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 1 LIMIT 1
UPDATE `tweets` SET `tweets`.`body` = 'ipjfcx', `tweets`.`updated_at` = '2020-11-03 05:38:05.666928' WHERE `tweets`.`id` = 1

      def destroy
        tweet = Tweet.find(params[:id])
        tweet.destroy
---
SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 1 LIMIT 1
DELETE FROM `tweets` WHERE `tweets`.`id` = 1